scripts.org
#+AUTHOR: Einar Elén
#+EMAIL: einar.elen@gmail.com
#+OPTIONS: toc:3 html5-fancy org-html-preamble:nil
#+HTML_DOCTYPE_HTML5: t
#+STARTUP: noinlineimages

* Table of Contents                                                     :TOC:
- [[#emacs-lisp-script-to-install-the-latest-version-of-emacs][Emacs Lisp Script to Install the Latest Version of Emacs]]
  - [[#setup-and-configuration][Setup and Configuration]]
  - [[#building-and-installing-emacs][Building and Installing Emacs]]
  - [[#handling-errors][Handling Errors]]
  - [[#finalizing-the-script][Finalizing the Script]]
- [[#backup-all-agenda-and-configuration-files][Backup All Agenda and Configuration Files]]
- [[#some-scripts-to-tangle-and-compile-files][Some Scripts to Tangle and Compile Files]]
  - [[#tangling][Tangling]]
  - [[#compiling][Compiling]]
  - [[#both][Both]]
- [[#bash-script-to-install-an-emacs-version-if-none-exists-already][Bash Script to Install an Emacs Version if None Exists Already]]
- [[#deprecatedunused-at-the-moment][Deprecated/Unused at the Moment]]
  - [[#profilingdebugging-the-configuration][Profiling/Debugging the Configuration]]
  - [[#gnome-server][Gnome Server]]
- [[#local-variables][Local Variables]]

* Emacs Lisp Script to Install the Latest Version of Emacs

** Setup and Configuration
*** Script setup

Turn the regular elisp-file into a script file
#+BEGIN_SRC emacs-lisp :tangle scripts/install-emacs.el
#!/usr/bin/emacs --script
(setq default-directory "~/.emacs.d/scripts/")
#+END_SRC

Load the support file from [[*Script helper-functions][Script helper-functions]].
#+BEGIN_SRC emacs-lisp :tangle scripts/install-emacs.el
;; Some convenience functions are defined in this file.
;; They make the script easier to read if you are new to
;; elisp (emacs lisp) Feel free to have a look at them if
;; you want to but it should not be necessary
(load-file "install-emacs-helpers.el")
#+END_SRC

Some help for people viewing the script file from either gedit or kate as these do not have syntax highlighting for elisp.
#+BEGIN_SRC emacs-lisp :tangle scripts/install-emacs.el
;; Anything following semi-colons is a comment

;; Neither of the two default text-editors for the two major
;; desktop environments on linux support syntax highlighting
;; for emacs lisp.

;; In gedit (the gnome text editor) open the menu in the
;; bottom left corner which most likely is set to "Plain
;; Text" and select LLVM IR

;; In Kate (the KDE text editor) open the menu in the bottom
;; left corner which is likely set to "Normal" and choose
;; Sources -> Common Lisp.


;; Of course, if you are viewing this from emacs, you should
;; be just fine already :)
#+END_SRC


*** User Configuration Variables
Explain how `setq' works.
#+BEGIN_SRC emacs-lisp :tangle scripts/install-emacs.el
;; Setq takes pairs of variable and new-value and sets the
;; value of the variable to new-value.  The q refers to the
;; fact that you do not need to quote the variable name.
;; You can think of it as a short-hand for:
;; (set 'variable new-value ...) (setq variable new-value)
;; Everything you might want to customize is available here
;; in this first block. You should only ever have to customize the
;; strings, e.g. "~/src" not the whole
;; (file-name-as-directory .... "~/src") construct

#+END_SRC
Some variables that you might want to change before running the script.
- emacs-git-url
  + The url to the git repository to clone from.
  + Default: "https://github.com/emacs-mirror/emacs"
  + Common alternatives:
    * "git://git.sv.gnu.org/emacs.git"
- emacs-git-branch
  + The branch to clone from
  + Default: "master"
- emacs-installation-directory-prefix
  + The prefix for the configure step.
  + Default: "/usr/local"
  + Common alternatives:
    * "/usr"
    * "/opt"
- emacs-source-directory-base
  + The directory which we will clone the emacs sources into
  + Default: "~/src"
- emacs-source-directory
  + The name of the directory in emacs-source-directory-base
    that we clone into
  + Default: "emacs"
  + Example resulting directory name if you use the default
    values: "~/src/emacs"
- autoreconf-arguments
  + Arguments to autoreconf
  + Default: "-i -v"
- number-of-make-processes
  + How many threads make can use
  + Default: "-j8"
  + Common alternatives:
    * "-j1"
    * "-j4"


#+BEGIN_SRC emacs-lisp :tangle scripts/install-emacs.el

;; These are the settings you might want to edit along with description of each option. There are some more possible settings in a second setq-block.
(setq
 ;; The url to the git repository for emacs
 ;; Common choices are
 ;; "git://git.sv.gnu.org/emacs.git"
 ;; "https://github.com/emacs-mirror/emacs"
 emacs-git-url
 "borkhttps://github.com/emacs-mirror/emacs"
 ;; Clone the latest and greatest version
 ;; Change if you want something else or if the master
 ;; branch is broken
 emacs-git-branch
 "master"
 ;; Define what main directory you would like your emacs
 ;; installation in

 ;; Common choices include
 ;; /usr, /usr/local/, /opt, etc
 emacs-installation-directory-prefix
 "/usr/local"
 ;; What directory should the project be cloned into?

 ;; The script will create the directory if it does not
 ;; exist already. You do not need to worry about trailing
 ;; backslashes.
 emacs-source-directory-base
 (file-name-as-directory
  (expand-file-name "~/src/poo/"))
 ;; What should the directory of the cloned project be
 ;; called?
 emacs-source-directory
 (file-name-as-directory
  (concat
   emacs-source-directory-base
   "emacs"))
 ;; Arguments to the autoreconf tool
 autoreconf-arguments
 (make-command-string "-i" "-v")
 ;; The number of independent threads the make program can
 ;; use.  Setting it to -jN where N is the number of cores
 ;; available on your machine.
 number-of-make-processes
 "-j8")
#+END_SRC


*** Other Configuration
These are settings you are less likely to want to
change. They are well-documented within the code but are
outlined here along with their default values.

- emacs-optimization-flags
  + The flags for the C-compiler which tune how aggressively
    it should be optimizing emacs.
  + Default: "-O3 -ffast-math -march=native -pipe"
  + Common alternative (for debugging the executable)
    * "-Og -g -march=native -pipe"
- make-commands
  + Which make targets to build. In other words, when
    building get a item from the list and run ``make item''
    and repeat until the list is empty.
  + Default (all targets): ("" "doc" "tags")
- make-install-command
  + The command to initialise the installation process for make.
  + Default: "make install"




#+BEGIN_SRC emacs-lisp :tangle scripts/install-emacs.el
;; These are settings that you are unlikely to want to edit.
(setq
 ;; Optimisation flags to the C-compiler.
 ;; You probably don't need to touch these

 ;; There is some good documentation about these on by RedHat at
 ;; https://developers.redhat.com/blog/2018/03/21/compile r-and-linker-flags-gcc/
 ;; Additionally, https://gcc.gnu.org/onlinedocs/gcc/Optimize-Options.html#Optimize-Options
 ;; is useful.

 ;; Flags to the compiler is an interesting topic.
 ;; I highly recommend a talk by Tim Haines at CppCon 2016
 ;; https://www.youtube.com/watch?v=w5Z4JlMJ1VQ

 ;; -march=native tells the compiler to use any
 ;; functionality available on your processor (by default,
 ;; it uses a very generic processor which will likely lack
 ;; many of the fancy features that your expensive processor
 ;; has available. This is very useful if you plan to share
 ;; the executable but we have no such plans.
 ;;

 ;; -O3 is the optimisation level. The default is -O2, and
 ;; some people claim experience issues with -O3. I have
 ;; never had any such trouble but feel free to change it

 ;; Similarly, -ffast-math tells the compiler to use
 ;; floating-point mathematics optimisations that are not
 ;; strictly compliant with the IEEE standards
 ;;
 ;; See https://stackoverflow.com/questions/7420665/what-does-gccs-ffast-math-actually-do

 ;; -pipe avoids creating some temporary files during the
 ;; build process, speeding up the install but making
 ;; re-builds if the process is interrupted slower

 emacs-optimization-flags
 "-O3 -ffast-math -march=native -pipe"
 ;; If you wish to debug your emacs executable, use the
 ;; alternative flags below:
 ;; "-Og -g -march=native -pipe"

 ;; -Og turns on any optimisations that doesn't make the
 ;; program harder to debug
 ;; -g turns on debugging information

 ;; This is the set of commands to the configure process. It
 ;; is generated from your previous settings.
 emacs-configuration-string
 (make-command-string  (concat
                        "--prefix="
                        emacs-installation-directory-prefix)
                       (concat
                        "CFLAGS=\'"
                        emacs-optimization-flags
                        "\'")
                       (concat
                        "CXXFLAGS=\'"
                        emacs-optimization-flags
                        "\'"))
 make-commands
 '("" "doc" "tags")
 make-install-command
 "make install")
#+END_SRC


*** Defining the Main Function
Here we define a main function which we will call later as
the entry point for the script after all the definitions are
taken care of. This is mainly for instructional purposes, it
introduces both how to define functions with `defun' and how
to manage errors with `condition-case'.

The function itself is rather simple, it wraps a call, using
`condition-case', to (in this order) the functions defined
in the sections listed below:
- [[*Cloning the Project][Cloning the Project]],
- [[*Configuring the
 Sources][Configuring the Sources]], and
- [[*Building and Installing the Program][Building and Installing the Program]]

#+BEGIN_SRC emacs-lisp :tangle scripts/install-emacs.el
;; Defun - short for define function (lisp has an
;; interesting way of abbreviating things) defines a
;; function. My faviourites are lst for "list" and elt for
;; "element", or just p for "predicate".

;; The syntax is
;; (defun function-name (list of arguments) "Documentation" code)

;; If the function takes no arguments, the list of arguments
;; is left empty as below


;; Here we define a main function which will be the first of
;; our functions to run after our definitions. It is called
;; later in the program.

(defun main ()
  "Here we could write some documentation about what this
function does. Since this function only exists to be called by
the script, it doesn't really need any particularly fancy
documentation.

We mostly define this function for instructional purposes, to
show how to define a basic function but it will be the
entry-point for the script in the end of the script.

Note that we will write function-calls to functions we define
later in the script. This is fine as they will be defined before
we actually call the main-function.

We call it main by convention with other programming languages,
we could have called it foo-bar if we wanted to. There is no
magic going on in lisp (cough python)."

  ;; We wrap the tasks we are about to take on in a
  ;; error-handling block called
  ;; `condition-case'. Condition-case takes two regular
  ;; arguments and one "rest..." argument which any
  ;; additional arguments becomes bound to. In other words,
  ;; the syntax is:

  ;; (condition-case VAR BODYFORM &rest HANDLERS)
  ;; It is used as follows:
  ;; (condition-case error-variable code-to-wrap
  ;; error-handler-1 error-handler-2... error-handler-N)
  ;;
  ;; The first argument is a variable-name which any
  ;; potential errors will be bound to. The second argument
  ;; is the code that might signal errors. Finally, any
  ;; number of arguments can be passed and they will each be
  ;; treated the same way (They are simply passed as a list
  ;; called, in this case, handlers).
  ;;
  ;; As only one argument can take the place of the
  ;; code-to-place variable, it is common to use the
  ;; `progn'-function. The `progn'-function simply evaluates
  ;; one block after another which allows you to write
  ;; several expressions without taking up several slots in
  ;; an argument list.

  ;; Condition case begins by evaluating the code to the
  ;; second argument, in our case `clone-emacs-tree',
  ;; `configure-emacs-sources', and
  ;; `build-and-install-emacs' which are wrapped up in a
  ;; `progn'-block.

  ;; If any of the functions is unable to finish their job,
  ;; they will signal this by throwing an exception of the
  ;; types created later in the code.

  ;; An exception/signal aborts the current line of
  ;; execution (i.e. none of the functions which would
  ;; follow are executed until the error is dealt with) and
  ;; moves backwards through the functions that have been
  ;; called until it encounters a condition-case block that
  ;; can deal with it.

  ;; When the condition-case block is found, the exception
  ;; variable is bound to the first argument (in our case,
  ;; err but it can be called whatever you like it to be
  ;; called).


  ;; The blocks following the initial progn consist of pairs
  ;; of exception-types (called condition-names) or a list
  ;; thereof and a body lisp expressions which are executed
  ;; if the exception in err matches the handler.


  (condition-case err
      (progn (clone-emacs-tree)
             (configure-emacs-sources)
             (build-and-install-emacs))
    ()
    ))

#+END_SRC
** Building and Installing Emacs
